magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_createShipment_negative.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Magento" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:salesOrderShipmentCreate soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId xsi:type="xsd:string">%s(sessionId)</sessionId>
         <orderIncrementId xsi:type="xsd:string">INVALID</orderIncrementId>
         <itemsQty xsi:type="urn:orderItemIdQtyArray" soapenc:arrayType="urn:orderItemIdQty[]"/>
         <comment xsi:type="xsd:string"></comment>
         <email xsi:type="xsd:int"></email>
         <includeComment xsi:type="xsd:int"></includeComment>
      </urn:salesOrderShipmentCreate>
   </soapenv:Body>
</soapenv:Envelope>